Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Set to enable (true) or disable (false) the application surface.
zh_cn: 设置启用(true)或禁用(false)应用程序表面。

source: Set to false to disable this output again.
zh_cn: 设置为false将再次禁用此输出。

source: Set to true or false to enable or disable orientation locking.
zh_cn: 设定true或false以启用或禁用方向锁定。

source: Set to true or false to enable or disable powersave functions.
zh_cn: 设置为true或false以启用或禁用节电功能。

source: Set to true or false to perform the destroy event or not (optional, default is true)
zh_cn: 设置为true或false以执行或不执行销毁事件(可选，默认为true)

source: Set to true or false.
zh_cn: 设置为true或false。

source: Set to true to attempt an OS level connection when called.
zh_cn: 设置为true以在被调用时尝试操作系统级连接。

source: Set to true to flip and false to leave it as-is
zh_cn: 设定为true以翻转，设定为false以保持原样

source: Set to true to mirror and false to leave it as-is
zh_cn: 设置为true以镜像，设置为false以保持原样

source: Set to true to rotate and false to leave it as-is
zh_cn: 设置为true以镜像，设置为false以保持原样

source: Set to true to turn on drawing, and false to turn it off.
zh_cn: 设定true以打开绘制，设定false以关闭绘制。

source: Set to true/false to enable/disable predictive text input.
zh_cn: 设置为true/false可启用/禁用预测性文本输入。

source: Sets the base time zone to use for all the rest of the date and time functions.
zh_cn: 设置基准时区，以用于所有其他日期和时间函数。

source: Sets the gain of the sound played.
zh_cn: 设置所播放声音的增益。

source: Sets the listener mask of the sound played.
zh_cn: 设置所播放声音的侦听器掩码(mask)。

source: Sets the maximum motor torque used to achieve the desired motor speed (in Newtons per meter)
zh_cn: 设置实现所需马达速度所需的最大马达转矩(牛顿/米)

source: Sets the maximum movement speed for the motor
zh_cn: 设置马达的最大运动速度

source: Sets the pitch of the sound played.
zh_cn: 设置播放的声音的音高。

source: Sets the reference value for alpha testing from 0 to 255 (default value is 0)
zh_cn: 将alpha测试的参考值从0设置为255(默认值为0)

source: Sets the sound to loop or not.
zh_cn: 设置声音是否循环。

source: Sets the start offset (in seconds) of the sound played.
zh_cn: 设置播放的声音的开始偏移量(以秒为单位)。

source: Sets the SO_LINGER timeout value to 0 for an exisiting TCP socket
zh_cn: 将现有TCP套接字的SO_LINGER超时值设置为0

source: Setting it to false will prevent the instance from participating in the physics world, and setting it to true will have it participating again.
zh_cn: 将其设置为false将阻止实例参与物理世界，将其设置为true将使其再次参与。

source: Setting it to true will repeat the texture if the uv coordinates are out with the 0-1 range, while a setting of false will mean no repeating.
zh_cn: 如果uv坐标在0-1范围之外，将其设置为true将重复纹理，而设置为false将意味着不重复。

source: Setting the density of the particle will have a direct impact on how much inertia it has as well as how it reacts to collisions, so if you make a small particle with a high density it will have a very large mass, but if you define a large particle with a low density it will have a much smaller mass.
zh_cn: 设置粒子的密度将直接影响它的惯性以及它对碰撞的反应，因此如果你制造一个高密度的小粒子，它将具有非常大的质量，但是如果你定义一个低密度的大粒子，它将具有小得多的质量。

source: Setting the mask index means that you can have, for example, a sprite for the instance with an irregular shape, yet give it a circular collision mask that is gotten from a different sprite.
zh_cn: 设置掩码索引意味着，例如，你可以拥有一个不规则形状的精灵实例，但给它一个从不同的精灵获得的圆形碰撞掩码。

source: Setting the persistence of the object means that all instances of this object that are created after the persistence has been changed will be created persistent, while instances that are already in the room may not be affected.
zh_cn: 设置对象的持久性意味着在更改持久性之后创建的该对象的所有实例将被创建为持久性，而已经在房间中的实例可能不会受到影响。

source: Setting this to true will connect the last point to the first point with an edge, while setting it to false will not.
zh_cn: 将此项设置为true会用边将最后一个点连接到第一个点，而将其设置为false则不会。

source: Setting this variable will instruct GameMaker to use the designated sprite as a cursor (basically setting it to the current mouse x/y position every step).
zh_cn: 设置此变量将指示GameMaker使用指定的精灵作为光标(基本上是将其设置为每一步的当前鼠标x/y位置)。

source: Short message for this exception.
zh_cn: 此异常的短消息。

source: Should anything penetrate it, the solid particle group pushes the offending fixture back out to its surface, making a a solid particle group possess an especially strong repulsive force.
zh_cn: 如果有任何东西穿透它，固体粒子群会将违规的固定物推回其表面，使固体粒子群具有特别强的排斥力。

source: Should you need more control over what is being saved, you should use the function screen_save_part().
zh_cn: 如果需要对保存的内容进行更多控制，则应该使用函数screen_save_part()。

source: Should you need the name as it appears in the Asset Browser, you should use font_get_name().
zh_cn: 如果您需要资源浏览器中显示的名称，您应该使用font_get_name()。

source: Should you need the particles to appear all at once rather than every step, you should be using the function part_emitter_burst().
zh_cn: 如果你需要粒子一次出现，而不是每一步都出现，你应该使用函数part_emitter_burst()。

source: Should you need the particles to appear every step, you should be using the function part_emitter_stream() rather than calling this function every step.
zh_cn: 如果你需要粒子在每一步都出现，你应该使用函数part_emitter_stream()而不是每一步都调用此函数。

source: Should you need to change the corner radius you should use the function draw_roundrect_colour_ext().
zh_cn: 如果你需要改变角的半径，你应该使用函数draw_roundrect_colour_ext()。

source: Should you need to change this value, you must do so by changing the x and y vectors using the variables phy_speed_x and phy_speed_y.
zh_cn: 如果需要改变该值，必须使用变量phy_speed_x和phy_speed_y改变x和y矢量。

source: Should you need to keep a consistent value over a number of runs of a game, you should be using random_set_seed().
zh_cn: 如果你需要在游戏的多次运行中保持一个一致的值，你应该使用random_set_seed()。

source: Should you need to use both the parent object event and the child object event of the same type, you should use this function as it will run the parent object event before continuing with the rest of the code or actions that the child event contains.
zh_cn: 如果需要同时使用同一类型的父对象事件和子对象事件，则应该使用此函数，因为它将在继续处理子事件所包含的其余代码或操作之前运行父对象事件。

source: Should you need truly random results for everything, you should be using the randomise() function.
zh_cn: 如果你需要真正随机的结果，你应该使用randomise()函数。

source: Should you wish to test with true random, you should call this function at the start of your game.
zh_cn: 如果你想用真随机测试，你应该在游戏开始时调用此函数。

source: Show challenges received pop-up (true) or not (false).
zh_cn: 显示收到的挑战弹出(true)或不弹出(false)。

source: Show completed local challenges pop-up (true) or not (false).
zh_cn: 显示已完成的本地挑战弹出(true)或不弹出(false)。

source: Show completed remote challenges pop-up (true) or not (false).
zh_cn: 显示完成的远程挑战弹出(true)或不弹出(false)。

source: Similar to additive blending.
zh_cn: 类似于叠加混合。

source: Since once a fixture has been bound to an instance that instance maintains the fixtures properties, we can remove the fixture from memory with this function, particularly if we no longer plan to use it again.
zh_cn: 因为一旦一个fixture被绑定到一个实例，该实例维护了夹具的属性，我们可以使用此函数从内存中删除该fixture，特别是在我们不再计划使用它的时候。

source: Since the GUI layer can be set to be a different size independently of the screen resolution and the room size, it can sometimes be complicated to get the exact point on the GUI layer that a user has touched the screen.
zh_cn: 由于GUI层可以独立于屏幕分辨率和房间大小而被设置为不同的大小，因此获取用户触摸屏幕的GUI层上的确切点有时会很复杂。

source: Since this function modifies the view matrix and not the projection matrix, you should first initialize the projection matrix using the other matrix function matrix_build_projection_perspective(), then use this function to move the view camera around within the projection.
zh_cn: 由于此函数修改视图矩阵，而不是投影矩阵，因此您应该首先使用另一个矩阵函数matrix _ build _ projection _ perspective()初始化投影矩阵，然后使用此函数在投影内移动视图相机。

source: Since tiles can be animated, it can sometimes be useful to know which frame is currently being drawn and react accordingly, so with this function you can retrieve the current frame index for a given tile map.
zh_cn: 由于tiles可以被动画化，因此知道当前正在绘制哪一帧并做出相应的反应有时会很有用，因此使用此函数可以检索给定tile map的当前帧索引。

source: Since you cannot change the value of a shader constant within the shader itself, you have to set it before calling the shader using one of the available uniform set functions.
zh_cn: 因为你不能在着色器本身中改变着色器常量的值，你必须在使用一个可用的统一(uniform)设置函数调用着色器之前设置它。

source: Since you cannot change the value of a shader sampler within the shader itself, you have to set it before calling the shader using one of the available uniform set functions.
zh_cn: 因为你不能在着色器本身中改变着色器采样器的值，你必须在使用一个可用的统一设置函数调用着色器之前设置它。

source: Slowing these particles down by reducing gravity scale can stabilize their behaviour.
zh_cn: 通过减少重力比例来减缓这些粒子的速度可以稳定它们的行为。

source: So a string formatted as:
zh_cn: 因此，字符串格式为:

source: So a typical ini file would look something like this:
zh_cn: 所以一个典型的ini文件应该是这样的:

source: So a value of 2 for a texture width or height would draw the texture in half the space and leave the other half empty).
zh_cn: 因此纹理宽度或高度的值为2将在一半的空间中绘制纹理，而让另一半为空)。

source: So a value of 32 for the hsnap and vsnap will set the instance to a random position that is aligned to a grid of 32x32 squares.
zh_cn: 因此，hsnap和vsnap的值为32会将实例设置为随机位置，该位置与32x32个正方形的网格对齐。

source: So exp(3) would return 20.08, which means that after 3 time units we have 20.08 times the amount we started with.
zh_cn: 所以 exp(3) 将返回 20.08，这意味着在 3 个时间单位之后，我们的数量是开始数量的 20.08 倍。

source: So if we want to find out how many time units we need to get 20 growth we would use ln(20) which returns 2.99 units of time to get that amount of growth.
zh_cn: 因此，如果我们想知道我们需要多少时间单位来获得20的增长，我们将使用ln(20 ),它返回2.99个时间单位来获得该数量的增长。

source: So if you do, for example:
zh_cn: 所以如果你这样做了，举个例子:

source: So if your physics object is meant to represent a person, their mass would be approximately 70 kilos.
zh_cn: 因此，如果你的物理对象代表一个人，他们的质量大约是70公斤。

source: So let's consider the following image which shows how the two can correlate:
zh_cn: 因此，让我们考虑下图，该图显示了这两者之间的关系:

source: So log10(100) returns 2, as multiplying 10 by itself gives 100, log10(1000) returns 3 as 10x10x10=1000 etc...
zh_cn: 因此，log10(100)返回2，因为10乘以自身得到100，log10(1000)返回3，因为10x10x10=1000，等等...

source: So to find what number has been multiplied with itself to get any given positive value we use this function.
zh_cn: 因此，为了找出哪个数与自身相乘得到任何给定的正值，我们使用此函数。

source: So we need 7 bits to represent 100.
zh_cn: 所以我们需要7位来代表100。

source: So when (for example) you are using view port[0] and view port[1] in your game room, the draw event for ALL instances will be run twice, once for each port, and with this variable you can check to see what view is currently being drawn.
zh_cn: 因此，当(例如)您在游戏房间中使用view port[0]和view port[1]时，所有实例的draw事件将运行两次，每个端口一次，使用此变量您可以查看当前正在绘制的视图。

source: So, a balloon would have a low density as it has little mass that occupies a large space, while a lead bar would have a high density as it has a great mass, yet occupies little space.
zh_cn: 因此，气球的密度低，因为它的质量小，但占用的空间大;而铅条的密度高，因为它的质量大，但占用的空间小。

source: So, a vspeed of 3 means 3 pixels of movement to the bottom (+y) every step, and a vspeed of -3 would mean 3 pixels of movement to the top (-y) every step.
zh_cn: 因此，vspeed为3意味着每步向底部(+y)移动3个像素，vspeed为-3意味着每步向顶部(-y)移动3个像素。

source: So, an hspeed of 3 means 3 pixels of movement to the right (+x) every step, and an hspeed of -3 would mean 3 pixels of movement to the left (-x) every step.
zh_cn: 所以，hspeed为3意味着每一步向右移动3个像素(+x)，而hspeed为-3则意味着每一步向左移动3个像素(-x)。

source: So, both arguments need to be object indices and not the instance ids, and the first one is always the object that you want to find out if it is a child of the second argument, which is always the object that want to check as the ancestor (parent).
zh_cn: 因此，两个参数都需要是对象索引而不是实例id，第一个参数总是您想要查明它是否是第二个参数的子对象，第二个参数总是想要检查为祖先(父)的对象。

source: So, for example, if the room is 480px in height and you set it to 640px, the room will be expanded downwards with an extra 180px added to the bottom.
zh_cn: 例如，如果房间的高度为480像素，而您将其设置为640像素，则房间将向下扩展，底部增加180像素。

source: So, for example, if you have a string-map of "AaBbCcDdEeFfGgHh", your sprite font must have the sub-images ordered in this way.
zh_cn: 因此，例如，如果你有一个字符串映射"AaBbCcDdEeFfGgHh"，你的sprite字体必须有这样排序的子图像。

source: So, for example, to get a random number from 0 to 9 you can use irandom(9) and it will return a number from 0 to 9 inclusive.
zh_cn: 例如，要得到一个从0到9的随机数，你可以使用irandom(9 ),它将返回一个从0到9的数。

source: So, if you have a path point set to 50 in the path editor, this function would return 50 when used.
zh_cn: 因此，如果在路径编辑器中将路径点设置为50，那么此函数在使用时将返回50。

source: So, if you have a return value of, for example, four, then you will have audio input on the sources 0, 1, 2 and 3, with one of these values being that which you use to start recording from using the function audio_start_recording().
zh_cn: 因此，如果您有一个返回值，例如4，那么您将在源0、1、2和3上有音频输入，其中一个值是您使用函数audio_start_recording()开始记录的值。

source: So, if you have a stationary instance and a moving instance then connect them with a friction joint, the moving instance will gradually slow down until it too is stationary.
zh_cn: 因此，如果您有一个静止的实例和一个移动的实例，然后用摩擦关节将它们连接起来，移动的实例将逐渐减速，直到它也静止。

source: So, if you have a timeline with 8 different actions placed 20 moments apart, this function would return the moment value of the last action in that timeline, which would be 160.
zh_cn: 因此，如果您有一个时间线，其中8个不同的动作相隔20个时刻，此函数将返回该时间线中最后一个动作的时刻值，即160。

source: So, if you have two different view ports at two different positions, the total area that they cover defines the size of the game window.
zh_cn: 因此，如果你在两个不同的位置有两个不同的观察口，它们覆盖的总面积决定了游戏窗口的大小。

source: So, mean(2, 6, 9, 32) returns 12.25 as 2+6+9+32=49 and 49/4=12.25.
zh_cn: 因此，均值(2,6,9,32)返回12.25，即2+6+9+32=49和49/4=12.25。

source: So, to make an instance kinematic, you would first create a static instance and then set one or more of the instance variables related to movement (ie: phy_speed_x, phy_speed_y, or phy_angular_velocity)
zh_cn: 因此，要使实例运动，首先要创建一个静态实例，然后设置一个或多个与运动相关的实例变量(即:phy_speed_x、phy_speed_y或phy_angular_velocity)

source: So, what to do?
zh_cn: 那么，该怎么办呢?

source: So, when two instances collide, their motion is affected by this value, with a high friction causing a larger loss of momentum than a lower value.
zh_cn: 因此，当两个实例碰撞时，它们的运动受到这个值的影响，与较低的值相比，高的摩擦会导致更大的动量损失。

source: So, you can have a persistent object and a non-persistent instance of the same object and vice-versa.
zh_cn: 因此，您可以拥有同一个对象的一个持久对象和一个非持久实例，反之亦然。

source: So, you can have a solid object and a normal instance of the same object and vice-versa.
zh_cn: 所以，你可以有一个实体对象和同一个对象的一个普通实例，反之亦然。

source: So, you can have a visible object and an invisible instance of the same object and vice-versa.
zh_cn: 因此，您可以拥有同一个对象的可见对象和不可见实例，反之亦然。

source: So, you supply the input string and the start and end position within that string to remove characters (index starts at 1) and the function will return a new string without that section in it.
zh_cn: 因此，您提供输入字符串以及该字符串中的开始和结束位置来删除字符(索引从1开始)，函数将返回一个不包含该部分的新字符串。

source: So, you would have your "main" canvas, and then your secondary surface canvas elements, which will be assigned using this function to the correct surfaces.
zh_cn: 因此，您将拥有您的"主"画布，然后是您的辅助表面画布元素，这些元素将使用此函数分配给正确的表面。

source: Social event
zh_cn: 社交事件

source: Some of the available commands require an optional argument or arguments.
zh_cn: 一些可用的命令需要一个或多个可选参数。

source: Some times you will want your game to detect and recognise when two instances with fixtures collide, but not have any physical reaction to the collision.
zh_cn: 有时候你会希望你的游戏能够检测和识别两个有夹具的实例发生碰撞，但不会对碰撞有任何物理反应。

source: Sometimes the problem can be in the rendering part of your game, for example a sprite may be drawn at the wrong position or rotation, giving the appearance of incorrect physics, or it may be that your calculations are not correct.
zh_cn: 有时问题可能出在你游戏的渲染部分，例如一个精灵可能被画在错误的位置或旋转，给人不正确的物理外观，或者可能是你的计算不正确。

source: Sometimes when making a game you may wish one key to do the same as another.
zh_cn: 有时候在制作游戏时，你可能希望一个键和另一个键做同样的事情。

source: Sometimes you may wish to get the ascii code for a mapped key (to see if it is already mapped, for example) which is what this function returns. The function will take a keycode value as returned by the function ord() (only capital letters from A-Z or numbers from 0-9), or any of the vk_* constants listed on the main Keyboard Input page.
zh_cn: 有时，您可能希望获得映射键的ascii代码(例如，查看它是否已经映射)，这就是此函数返回的内容。此函数将接受ord()函数返回的keycode值(只接受a - z中的大写字母或0-9中的数字)，或主键盘输入页面中列出的任何vk_*常量。

source: Sometimes you need to switch from a perspective projection to an orthographic projection which is what this function is for.
zh_cn: 有时你需要从透视投影转换到正投影，这就是此函数的用途。

source: Sometimes you want to specify something other than numbers for a random selection, or the numbers you want are not in any real order or within any set range.
zh_cn: 有时您希望为随机选择指定除数字以外的其他内容，或者您想要的数字没有任何实际顺序或在任何设置范围内。

source: Sony PlayStation 4
zh_cn: 索尼 PlayStation 4

source: Sony PlayStation 5
zh_cn: 索尼 PlayStation 5

source: Source blend mode factor Alpha (see constants above).
zh_cn: 源混合模式乘数Alpha(见上面的常量)。

source: Source blend mode factor for RGB (see constants above).
zh_cn: RGB的源混合模式乘数(参见上面的常量)。

source: Source blend mode factor(see constants above).
zh_cn: 源混合模式乘数(见上面的常量)。

source: Special "stripped" buffer that is extremely fast to read/write to.
zh_cn: 特殊的"剥离"缓冲区，读/写速度极快。

source: Specifies default sprite which is used for drawing when a texture group hasn't been loaded
zh_cn: 指定在纹理组未加载时用于绘图的默认精灵

source: Specifies that playbackSpeed should be interpreted as frames-per-game-frame.
zh_cn: 指定回放速度应该被解释为每帧游戏帧。

source: Specifies that playbackSpeed should be interpreted as frames-per-second
zh_cn: 指定回放速度应该被解释为每秒帧数

source: Spring particles produce the effect of being attached to one another, as if by a spring.
zh_cn: 弹簧粒子产生相互连接的效果，就像被弹簧连接一样。

source: Standard browser options (see description).
zh_cn: 标准浏览器选项(见描述)。

source: Starting x coordinate of the mp_grid in the room
zh_cn: 房间中mp_grid的起始x坐标

source: Starting x coordinate of the new path
zh_cn: 新路径的起始x坐标

source: Starting y coordinate of the mp_grid in the room
zh_cn: 房间中mp_grid的起始y坐标

source: Starting y coordinate of the new path
zh_cn: 新路径的起始y坐标

source: Starts/Resumes the time source and all of its children.
zh_cn: 启动/恢复时间源及其所有子源。

source: Steam event
zh_cn: Steam事件

source: Step
zh_cn: 步 Step

source: Step event
zh_cn: 步事件 Step event

source: Stereo (dual channel) audio.
zh_cn: 立体声(双声道)音频。

source: Stops the time source and all of its children.
zh_cn: 停止时间源及其所有子级。

source: Strength of the gravity.
zh_cn: 重力的强度。

source: String from which sprite sub-image order is taken.
zh_cn: 从中获取精灵子图像顺序的字符串。

source: Struct containing the keycodes to mock
zh_cn: 包含要模仿的键码的结构

source: Struct containing the keycodes to track
zh_cn: 包含要跟踪的键码的结构

source: Subtractive blending.
zh_cn: 减法混合。

source: Surfaces are always held in texture memory which means that they can be destroyed from one moment to the next (for example, when a screensaver starts on windows, or when minimised on an Android device), so you should always check that a surface exists before doing anything with it (this includes drawing it to the screen).
zh_cn: 表面总是保存在纹理内存中，这意味着他们可以从一个时刻到下一个销毁(例如，当屏幕保护程序在窗口启动时，或在Android设备上最小化时)，所以你应该在对它做任何事情之前总是检查一个表面是否存在(这包括将它绘制到屏幕上)。

source: Surfaces take up space in memory and so need to be removed, normally at the end of a room, but it can be done at any time depending on the use you put them to.
zh_cn: 表面占用内存空间，因此需要删除，通常是在房间的尽头，但也可以在任何时候完成，这取决于你使用它们的用途。

source: Switching v-sync on may give a smoother gaming experience but it will also need more processing power and so its impact must be considered careful before use, and the same goes for the anti-aliasing where the higher the number the more processing that is required.
zh_cn: 开启垂直同步可能会带来更流畅的游戏体验，但它也需要更多的处理能力，因此在使用前必须仔细考虑其影响，抗锯齿也是如此，数值越高，需要的处理越多。

source: Synchronize the rollback game on the current frame.
zh_cn: 在当前帧上同步回滚游戏。

source: System event
zh_cn: 系统事件

source: System files
zh_cn: 系统文件

source: Tell GameMaker not to block on connect.
zh_cn: 告诉GameMaker不要阻塞连接。

source: Tell GameMaker to accept 2D positional data (x and y) as part of the new vertex format being created.
zh_cn: 告诉GameMaker接受2D位置数据(x和y)作为正在创建的新顶点格式的一部分。

source: Tell GameMaker to accept 3D positional data (x, y and z) as part of the new vertex format being created.
zh_cn: 告诉GameMaker接受3D位置数据(x、y和z)作为正在创建的新顶点格式的一部分。

source: Tell GameMaker to accept colour data as part of the new vertex format being created.
zh_cn: 告诉GameMaker接受颜色数据作为正在创建的新顶点格式的一部分。

source: Tell GameMaker to accept surface normal data (nx, ny and nz) as part of the new vertex format being created.
zh_cn: 告诉GameMaker接受表面法线数据(nx，ny和nz)作为正在创建的新顶点格式的一部分。

source: Tell GameMaker to accept texture position data (u and v) as part of the new vertex format being created.
zh_cn: 告诉GameMaker接受纹理位置数据(u和v)作为正在创建的新顶点格式的一部分。

source: Tensile particles are used to produce the effect of surface tension, or the taut curvature on the surface of a body of liquid.
zh_cn: 张力粒子用于产生表面张力效应，或液体表面的绷紧曲率。

source: Text that appears on the "no" button.
zh_cn: 出现在"否"按钮上的文本。

source: Text that appears on the "yes" button.
zh_cn: 出现在"是"按钮上的文本。

source: Text that appears on the dialog.
zh_cn: 出现在对话框上的文本。

source: Textures are represented by arrays of texels, just as pictures are represented by arrays of pixels, and this function returns the height of a single texel from the texture page of the image asset used.
zh_cn: 纹理由纹理数组表示，就像图片由像素数组表示一样，此函数从所使用的图像资源的纹理页面返回单个纹理的高度。

source: Textures are represented by arrays of texels, just as pictures are represented by arrays of pixels, and this function returns the width of a single texel from the texture page of the image asset used.
zh_cn: 纹理由纹理数组表示，就像图片由像素数组表示一样，此函数从使用的图像资源的纹理页面返回单个纹理的宽度。

source: Thankfully there is a simpler method, and that is to use a gear joint.
zh_cn: 谢天谢地，有一个更简单的方法，那就是使用齿轮关节。

source: That said, if you do use it to size up an array, any new indices will be set to the default value of 0.
zh_cn: 也就是说，如果使用它来增大数组的大小，则任何新的下标都将设置为默认值0。

source: The "fire_time" is the date/time that the notification should be pushed to the user device (you can use the GameMaker Date and Time Functions to get this), and you can give the notification a title and a message text as well as a payload string which will be passed to your game when the users taps the notification.
zh_cn: "fire_time"是通知应该推送到用户设备的日期/时间(你可以使用GameMaker date and time函数来获得这个)，你可以给通知一个标题、一个消息文本以及一个载荷字符串，当用户点击通知时，它将被传递到你的游戏中。

source: The "flags" are the return value of a combination of the following constants:
zh_cn: "flags"是以下常量组合的返回值:

source: The "groupname" is a string and will be used as the directory name for where the files will be saved, and should be used as part of the file path when loading the files back into the IDE later (using any of the buffer_load() functions).
zh_cn: "groupname"是一个字符串，将用作保存文件的目录名称，并且在以后将文件加载回IDE时(使用任何buffer_load()函数)，应该将其用作文件路径的一部分。

source: The "index" value can be that of the resource itself (as seen in the Asset Browser) or the unique ID value that is given when you play the sound using, for example, audio_play_sound().
zh_cn: "index"值可以是资源本身的值(如在资源浏览器中所见)，也可以是使用 audio_play_sound() 播放声音时给出的惟一ID值。

source: The "offset" defines the start position within the buffer for loading (in bytes), and the "size" is the size of the buffer area to be loaded from that offset onwards (also in bytes).
zh_cn: "偏移量"定义了缓冲区内加载的起始位置(以字节为单位)，而"大小"是从该偏移量开始加载的缓冲区的大小(也以字节为单位)。

source: The "offset" defines the start position within the buffer for saving (in bytes), and the "size" is the size of the buffer area to be saved from that offset onwards (also in bytes).
zh_cn: "偏移量"定义了缓冲区内用于保存的起始位置(以字节为单位)，"大小"是从该偏移量开始要保存的缓冲区的大小(也以字节为单位)。

source: The "offset" is the position within the buffer to decode the given string (in bytes).
zh_cn: "偏移量"是缓冲区中解码给定字符串的位置(以字节为单位)。

source: The "offset" value is the offset (in bytes) to add to the given seek position, for example, if the base is relative and the offset is 4, then the buffer position will move along 4 bytes from its current position.
zh_cn: "偏移量"值是要添加到给定查找位置的偏移量(以字节为单位)，例如，如果基数是相对的，偏移量是4，则缓冲区位置将从其当前位置移动4个字节。
